app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dsaf;lkajsdf"], ["body", "bla bla blaa []"], ["created_at", "2015-09-03 01:26:48.238378"], ["updated_at", "2015-09-03 01:26:48.238378"]]
---
  def create
    @article = Article.new(article_params)
    respond_to do |format|
      if @article.save

UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "  jjbla bla blaa []"], ["updated_at", "2015-09-03 01:43:09.259785"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)