app/controllers/articles_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
---
  def show
    @comments = @article.comments.all