app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "technologies_used", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Whatever I say "], ["technologies_used", "what do you want now SLUG"], ["created_at", "2015-09-09 01:43:21.366340"], ["updated_at", "2015-09-09 01:43:21.366340"]]
---
  def create
    @project = Project.new(project_params)
    if @project.save